## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| update   | `aws_iam_policy.ecr`                              |
|          | `aws_lambda_alias.api_latest`                     |
|          | `aws_lambda_function.api`                         |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
13:35:23.851 STDOUT terraform:   ~ update in-place
13:35:23.851 STDOUT terraform: -/+ destroy and then create replacement
13:35:23.852 STDOUT terraform:  <= read (data resources)
13:35:23.852 STDOUT terraform: Terraform will perform the following actions:
13:35:23.852 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
13:35:23.852 STDOUT terraform:   # (depends on a resource or a module with changes pending)
13:35:23.852 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
13:35:23.852 STDOUT terraform:       + id            = (known after apply)
13:35:23.852 STDOUT terraform:       + json          = (known after apply)
13:35:23.852 STDOUT terraform:       + minified_json = (known after apply)
13:35:23.852 STDOUT terraform:       + statement {
13:35:23.852 STDOUT terraform:           + actions   = [
13:35:23.852 STDOUT terraform:               + "ecr:GetAuthorizationToken",
13:35:23.852 STDOUT terraform:             ]
13:35:23.852 STDOUT terraform:           + effect    = "Allow"
13:35:23.852 STDOUT terraform:           + resources = [
13:35:23.852 STDOUT terraform:               + "*",
13:35:23.852 STDOUT terraform:             ]
13:35:23.852 STDOUT terraform:           + sid       = "GetAuthorizationToken"
13:35:23.852 STDOUT terraform:         }
13:35:23.852 STDOUT terraform:       + statement {
13:35:23.852 STDOUT terraform:           + actions   = [
13:35:23.852 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
13:35:23.852 STDOUT terraform:               + "ecr:BatchGetImage",
13:35:23.852 STDOUT terraform:               + "ecr:CompleteLayerUpload",
13:35:23.852 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
13:35:23.852 STDOUT terraform:               + "ecr:InitiateLayerUpload",
13:35:23.852 STDOUT terraform:               + "ecr:PutImage",
13:35:23.852 STDOUT terraform:               + "ecr:UploadLayerPart",
13:35:23.852 STDOUT terraform:             ]
13:35:23.852 STDOUT terraform:           + effect    = "Allow"
13:35:23.852 STDOUT terraform:           + resources = [
13:35:23.852 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
13:35:23.853 STDOUT terraform:             ]
13:35:23.853 STDOUT terraform:           + sid       = "AllowPushPull"
13:35:23.853 STDOUT terraform:         }
13:35:23.853 STDOUT terraform:       + statement {
13:35:23.853 STDOUT terraform:           + actions   = [
13:35:23.853 STDOUT terraform:               + "lambda:GetAlias",
13:35:23.853 STDOUT terraform:               + "lambda:GetFunction",
13:35:23.853 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
13:35:23.853 STDOUT terraform:               + "lambda:ListAliases",
13:35:23.853 STDOUT terraform:               + "lambda:ListVersionsByFunction",
13:35:23.853 STDOUT terraform:               + "lambda:PublishVersion",
13:35:23.853 STDOUT terraform:               + "lambda:UpdateAlias",
13:35:23.853 STDOUT terraform:               + "lambda:UpdateFunctionCode",
13:35:23.853 STDOUT terraform:             ]
13:35:23.853 STDOUT terraform:           + effect    = "Allow"
13:35:23.853 STDOUT terraform:           + resources = [
13:35:23.853 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
13:35:23.853 STDOUT terraform:             ]
13:35:23.853 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
13:35:23.853 STDOUT terraform:         }
13:35:23.853 STDOUT terraform:       + statement {
13:35:23.853 STDOUT terraform:           + actions   = [
13:35:23.853 STDOUT terraform:               + "lambda:GetLayerVersion",
13:35:23.853 STDOUT terraform:             ]
13:35:23.853 STDOUT terraform:           + effect    = "Allow"
13:35:23.853 STDOUT terraform:           + resources = [
13:35:23.853 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
13:35:23.853 STDOUT terraform:             ]
13:35:23.853 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
13:35:23.853 STDOUT terraform:         }
13:35:23.853 STDOUT terraform:     }
13:35:23.853 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
13:35:23.853 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
13:35:23.854 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
13:35:23.854 STDOUT terraform:         name             = "ecr-api-lambda-access"
13:35:23.854 STDOUT terraform:       ~ policy           = jsonencode(
13:35:23.854 STDOUT terraform:             {
13:35:23.854 STDOUT terraform:               - Statement = [
13:35:23.854 STDOUT terraform:                   - {
13:35:23.854 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
13:35:23.854 STDOUT terraform:                       - Effect   = "Allow"
13:35:23.854 STDOUT terraform:                       - Resource = "*"
13:35:23.854 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
13:35:23.854 STDOUT terraform:                     },
13:35:23.854 STDOUT terraform:                   - {
13:35:23.854 STDOUT terraform:                       - Action   = [
13:35:23.854 STDOUT terraform:                           - "ecr:UploadLayerPart",
13:35:23.854 STDOUT terraform:                           - "ecr:PutImage",
13:35:23.854 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
13:35:23.854 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
13:35:23.854 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
13:35:23.854 STDOUT terraform:                           - "ecr:BatchGetImage",
13:35:23.854 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
13:35:23.854 STDOUT terraform:                         ]
13:35:23.854 STDOUT terraform:                       - Effect   = "Allow"
13:35:23.854 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
13:35:23.854 STDOUT terraform:                       - Sid      = "AllowPushPull"
13:35:23.854 STDOUT terraform:                     },
13:35:23.854 STDOUT terraform:                   - {
13:35:23.854 STDOUT terraform:                       - Action   = [
13:35:23.854 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
13:35:23.854 STDOUT terraform:                           - "lambda:UpdateAlias",
13:35:23.854 STDOUT terraform:                           - "lambda:PublishVersion",
13:35:23.854 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
13:35:23.854 STDOUT terraform:                           - "lambda:ListAliases",
13:35:23.854 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
13:35:23.854 STDOUT terraform:                           - "lambda:GetFunction",
13:35:23.854 STDOUT terraform:                           - "lambda:GetAlias",
13:35:23.854 STDOUT terraform:                         ]
13:35:23.854 STDOUT terraform:                       - Effect   = "Allow"
13:35:23.854 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
13:35:23.855 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
13:35:23.855 STDOUT terraform:                     },
13:35:23.855 STDOUT terraform:                   - {
13:35:23.855 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
13:35:23.855 STDOUT terraform:                       - Effect   = "Allow"
13:35:23.855 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
13:35:23.855 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
13:35:23.855 STDOUT terraform:                     },
13:35:23.855 STDOUT terraform:                 ]
13:35:23.855 STDOUT terraform:               - Version   = "2012-10-17"
13:35:23.855 STDOUT terraform:             }
13:35:23.855 STDOUT terraform:         ) -> (known after apply)
13:35:23.855 STDOUT terraform:         tags             = {}
13:35:23.855 STDOUT terraform:         # (7 unchanged attributes hidden)
13:35:23.855 STDOUT terraform:     }
13:35:23.855 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
13:35:23.855 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
13:35:23.855 STDOUT terraform:       ~ function_version = "1721" -> (known after apply)
13:35:23.855 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
13:35:23.855 STDOUT terraform:         name             = "latest"
13:35:23.855 STDOUT terraform:         # (5 unchanged attributes hidden)
13:35:23.855 STDOUT terraform:     }
13:35:23.855 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
13:35:23.855 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
13:35:23.855 STDOUT terraform:         id                             = "api-lambda"
13:35:23.855 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1721" -> (known after apply)
13:35:23.855 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1721/invocations" -> (known after apply)
13:35:23.855 STDOUT terraform:         tags                           = {}
13:35:23.855 STDOUT terraform:       ~ version                        = "1721" -> (known after apply)
13:35:23.855 STDOUT terraform:         # (27 unchanged attributes hidden)
13:35:23.855 STDOUT terraform:       ~ environment {
13:35:23.855 STDOUT terraform:           ~ variables = {
13:35:23.855 STDOUT terraform:               - "NEW_RELIC_IGNORE_STARTUP_ERRORS"       = "false" -> null
13:35:23.855 STDOUT terraform:               - "NEW_RELIC_LICENSE_KEY"                 = "460a1eddc146dc051d9c3e6f4b6702d0FFFFNRAL" -> null
13:35:23.856 STDOUT terraform:               - "NEW_RELIC_LOG"                         = "stdout" -> null
13:35:23.856 STDOUT terraform:               - "NEW_RELIC_LOG_LEVEL"                   = "debug" -> null
13:35:23.856 STDOUT terraform:               - "NR_STARTUP_DIAG"                       = "1" -> null
13:35:23.856 STDOUT terraform:                 # (19 unchanged elements hidden)
13:35:23.856 STDOUT terraform:             }
13:35:23.856 STDOUT terraform:         }
13:35:23.856 STDOUT terraform:         # (4 unchanged blocks hidden)
13:35:23.856 STDOUT terraform:     }
13:35:23.856 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
13:35:23.856 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
13:35:23.856 STDOUT terraform:       ~ id       = "206422844654225035" -> (known after apply)
13:35:23.856 STDOUT terraform:       ~ triggers = { # forces replacement
13:35:23.856 STDOUT terraform:           ~ "always_run" = "2025-09-18T19:55:38Z" -> (known after apply)
13:35:23.856 STDOUT terraform:         }
13:35:23.856 STDOUT terraform:     }
13:35:23.856 STDOUT terraform: Plan: 1 to add, 3 to change, 1 to destroy.
13:35:23.856 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:35:23.856 STDOUT terraform: Saved the plan to: plan.tfplan
13:35:23.856 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:35:23.856 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
